Autodesk.Revit.DB.ImageImportOptions.#ctor
Default constructor. Sets all options to their default values.

Autodesk.Revit.DB.ImageImportOptions.Placement
Identifies which point of the image will be aligned to the placement point Autodesk.Revit.DB.GenericImportOptions.RefPoint.
The default is BoxPlacement.Center.

Autodesk.Revit.DB.ImageImportOptions.Resolution
Resolution to use (in dpi) for the image to be imported.
The default is 72 dpi.

Autodesk.Revit.DB.ImageImportOptions
Options used to import specific image formats and place an instance of them on a view or sheet.